In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [6]:
data = [['Alex',10],['Bob',12],["Clarke",13]]
df = pd.DataFrame(data,columns=["Name","Age"],dtype=float)
print(df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [7]:
data = [['Alex',10],['Bob',12],["Clarke",13]]
df = pd.DataFrame(data,index=['a','b','c'],columns=["Name","Age"],dtype=float)
print(df)

     Name   Age
a    Alex  10.0
b     Bob  12.0
c  Clarke  13.0

In [8]:
data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}

In [9]:
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [10]:
data = [{'a':1,'b':2},{'a':5,'b':10,'c':20}]
df = pd.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [11]:
data = [{'a':1,'b':2},{'a':5,'b':10,'c':20}]
df = pd.DataFrame(data,index=['first','second'])
print(df)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [12]:
data = [{'a':1,'b':2},{'a':5,'b':10,'c':20}]
df = pd.DataFrame(data,index=['first','second'],columns=['q','w','e'])
print(df)

         q   w   e
first  NaN NaN NaN
second NaN NaN NaN

In [16]:
data = [{'a':1,'b':2},{'a':5,'b':10,'c':20}]
df1 = pd.DataFrame(data, index=['first','second'],columns=['a','b'])
df2 = pd.DataFrame(data, index=['first','second'],columns=['a','b1'])
print(df1)
print(df2)

        a   b
first   1   2
second  5  10
        a  b1
first   1 NaN
second  5 NaN

In [17]:
df1.index= ['aa','bb']
print(df1)

    a   b
aa  1   2
bb  5  10

In [21]:
d = {'one':pd.Series([1,2,3],index=['a','b','c']),
     'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [22]:
print(df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [29]:
df['there'] = pd.Series([10,20,30],index=['a','b','d'])
print(df)

   one  two  there
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3    NaN
d  NaN    4   30.0

In [30]:
df['four'] = df['one']+df['there']
print(df)

   one  two  there  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3    NaN   NaN
d  NaN    4   30.0   NaN

In [31]:
df.pop('four')

a    11.0
b    22.0
c     NaN
d     NaN
Name: four, dtype: float64

In [32]:
print(df)

   one  two  there
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3    NaN
d  NaN    4   30.0

In [33]:
print(df.loc['b'])

one       2.0
two       2.0
there    20.0
Name: b, dtype: float64

In [35]:
print(df.iloc[1])

one       2.0
two       2.0
there    20.0
Name: b, dtype: float64

In [36]:
print(df[2:4])

   one  two  there
c  3.0    3    NaN
d  NaN    4   30.0

In [37]:
print(df[1:3])

   one  two  there
b  2.0    2   20.0
c  3.0    3    NaN

In [38]:
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2 = pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df = df.append(df2)
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [39]:
df.drop(0)

   a  b
1  3  4
1  7  8

In [41]:
df = df.drop(0)
print(df)

   a  b
1  3  4
1  7  8

In [42]:
df.index=['one','two']
print(df)

     a  b
one  3  4
two  7  8

In [47]:
df.index

Index(['one', 'two'], dtype='object')

In [3]:
dt = {'product':pd.Series(['TV','KT','XYJ','PC']),'price':pd.Series([2300,1980,780])}

In [4]:
df = pd.DataFrame(dt)

In [5]:
df

  product   price
0      TV  2300.0
1      KT  1980.0
2     XYJ   780.0
3      PC     NaN

In [8]:
df.columns

Index(['product', 'price'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
df.values

array([['TV', 2300.0],
       ['KT', 1980.0],
       ['XYJ', 780.0],
       ['PC', nan]], dtype=object)

In [13]:
?df.value_counts

In [14]:
df.iloc[1]

product      KT
price      1980
Name: 1, dtype: object

In [15]:
df.loc[1]

product      KT
price      1980
Name: 1, dtype: object

In [16]:
df

  product   price
0      TV  2300.0
1      KT  1980.0
2     XYJ   780.0
3      PC     NaN

In [18]:
df['product'][1:3]

1     KT
2    XYJ
Name: product, dtype: object

In [19]:
df.index.name = 'id'

In [20]:
df.columns.name = 'item'

In [21]:
df

item product   price
id
0         TV  2300.0
1         KT  1980.0
2        XYJ   780.0
3         PC     NaN

In [22]:
df['discount'] = [0.9,0.85,0.95,.1]

In [23]:
df

item product   price  discount
id
0         TV  2300.0      0.90
1         KT  1980.0      0.85
2        XYJ   780.0      0.95
3         PC     NaN      0.10

In [24]:
df.insert(2,'Actual_price',df.price*df.discount)

In [25]:
df

item product   price  Actual_price  discount
id
0         TV  2300.0        2070.0      0.90
1         KT  1980.0        1683.0      0.85
2        XYJ   780.0         741.0      0.95
3         PC     NaN           NaN      0.10

In [27]:
df.insert(4,'Actual_price1',df['price']*df['discount'])

In [28]:
df

item product   price  Actual_price  discount  Actual_price1
id
0         TV  2300.0        2070.0      0.90         2070.0
1         KT  1980.0        1683.0      0.85         1683.0
2        XYJ   780.0         741.0      0.95          741.0
3         PC     NaN           NaN      0.10            NaN

In [30]:
df.loc['add_row'] = ['ph',1900,1900,1,1900]

In [31]:
df

item    product   price  Actual_price  discount  Actual_price1
id
0            TV  2300.0        2070.0      0.90         2070.0
1            KT  1980.0        1683.0      0.85         1683.0
2           XYJ   780.0         741.0      0.95          741.0
3            PC     NaN           NaN      0.10            NaN
add_row      ph  1900.0        1900.0      1.00         1900.0

In [32]:
df.loc[3] = ['PC',4500,4500,1,4500]

In [33]:
df

item    product   price  Actual_price  discount  Actual_price1
id
0            TV  2300.0        2070.0      0.90         2070.0
1            KT  1980.0        1683.0      0.85         1683.0
2           XYJ   780.0         741.0      0.95          741.0
3            PC  4500.0        4500.0      1.00         4500.0
add_row      ph  1900.0        1900.0      1.00         1900.0

In [35]:
df.price = [3000,2300,560,5600,1880]

In [36]:
df.pop('discount')

id
0          0.90
1          0.85
2          0.95
3          1.00
add_row    1.00
Name: discount, dtype: float64

In [38]:
del df['Actual_price1']

In [39]:
df

item    product  price  Actual_price
id
0            TV   3000        2070.0
1            KT   2300        1683.0
2           XYJ    560         741.0
3            PC   5600        4500.0
add_row      ph   1880        1900.0

In [40]:
df['discount'] = 0.94
df

item    product  price  Actual_price  discount
id
0            TV   3000        2070.0      0.94
1            KT   2300        1683.0      0.94
2           XYJ    560         741.0      0.94
3            PC   5600        4500.0      0.94
add_row      ph   1880        1900.0      0.94

In [41]:
df.drop(['discount'],axis=1,inplace=False)

item    product  price  Actual_price
id
0            TV   3000        2070.0
1            KT   2300        1683.0
2           XYJ    560         741.0
3            PC   5600        4500.0
add_row      ph   1880        1900.0

In [42]:
df['discount'] = 0.94
df.drop(['discount'],axis=1,inplace=True)

In [43]:
df

item    product  price  Actual_price
id
0            TV   3000        2070.0
1            KT   2300        1683.0
2           XYJ    560         741.0
3            PC   5600        4500.0
add_row      ph   1880        1900.0

In [44]:
df.drop(['add_row'],axis=0)

item product  price  Actual_price
id
0         TV   3000        2070.0
1         KT   2300        1683.0
2        XYJ    560         741.0
3         PC   5600        4500.0

In [45]:
df.drop([0,2],axis=0,inplace=True)

In [46]:
df

item    product  price  Actual_price
id
1            KT   2300        1683.0
3            PC   5600        4500.0
add_row      ph   1880        1900.0

In [47]:
df[df['price']>2000]

item product  price  Actual_price
id
1         KT   2300        1683.0
3         PC   5600        4500.0

In [48]:
df[df.price>2000]

item product  price  Actual_price
id
1         KT   2300        1683.0
3         PC   5600        4500.0

In [50]:
df[df.price<2000]

item    product  price  Actual_price
id
add_row      ph   1880        1900.0

In [51]:
df

item    product  price  Actual_price
id
1            KT   2300        1683.0
3            PC   5600        4500.0
add_row      ph   1880        1900.0

In [53]:
del df['Actual_price']

In [54]:
df

item    product  price
id
1            KT   2300
3            PC   5600
add_row      ph   1880

In [60]:
df.T

id          1     3 add_row
item
product    KT    PC      ph
price    2300  5600    1880

In [68]:
index_ = df.T.index

In [69]:
index_

Index(['product', 'price'], dtype='object', name='item')

In [74]:
inex_ = pd.Index(['a','b','c'])

In [75]:
inex_

Index(['a', 'b', 'c'], dtype='object')

In [77]:
sel = pd.Series([0,1,2],index=inex_)

In [79]:
sel

a    0
b    1
c    2
dtype: int64

In [80]:
'a' in inex_

True

In [82]:
index1 = pd.Index(['a','b','c'])

In [83]:
index2 = pd.Index(['c','d','b','e'])

In [84]:
index3 = index1.append(index2)

In [85]:
index3

Index(['a', 'b', 'c', 'c', 'd', 'b', 'e'], dtype='object')

In [86]:
index3 = index1.difference(index2)

In [88]:
index3

Index(['a'], dtype='object')

In [89]:
index3 = index1.intersection(index2)

In [90]:
index3

Index(['b', 'c'], dtype='object')

In [91]:
index3 = index1.union(index2)

In [92]:
index3

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [93]:
index3 = index1.isin(index2)

In [94]:
index3

array([False,  True,  True])

In [96]:
index1 = pd.Index(['a','b','c','d','e','f','g'])

In [97]:
index = index1.delete([0,3,6])

In [98]:
index1

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [99]:
index

Index(['b', 'c', 'e', 'f'], dtype='object')

In [100]:
index = index1.insert(1,'h')

In [101]:
index

Index(['a', 'h', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [102]:
index1 = pd.Index(['a','b','c','a'])

In [103]:
index1.is_unique

False

In [104]:
index2 = pd.Index(['a','b','c'])

In [105]:
index2.is_unique

True

In [106]:
index1 = pd.Index(['a','b','c'])

In [107]:
index1.is_monotonic_increasing

True

In [108]:
index2 = pd.Index(['c','b','a'])

In [109]:
index2.is_monotonic_decreasing

True

In [110]:
index1 = pd.Index(['a','b','a'])

In [112]:
index1.unique()

Index(['a', 'b'], dtype='object')

In [3]:
sel = pd.Series([1,4,-1,2],index=['a','e','d','c'])

In [4]:
sel

a    1
e    4
d   -1
c    2
dtype: int64

In [5]:
sel.reindex(['a','b','d','c','e'])

a    1.0
b    NaN
d   -1.0
c    2.0
e    4.0
dtype: float64

In [3]:
sel = pd.Series([2.1,4.3,-1.6], index=['c','e','a'])

In [4]:
sel

c    2.1
e    4.3
a   -1.6
dtype: float64

In [5]:
sel.reindex(['a','b','c','d','e'],fill_value = 0)

a   -1.6
b    0.0
c    2.1
d    0.0
e    4.3
dtype: float64

In [6]:
se2 = pd.Series(['20170101','20170102','20170104'],index=[0,2,4])

In [8]:
se2.reindex(range(6),method='ffill')

0    20170101
1    20170101
2    20170102
3    20170102
4    20170104
5    20170104
dtype: object

In [9]:
se2

0    20170101
2    20170102
4    20170104
dtype: object

In [10]:
se2.reindex(range(6),method='bfill')

0    20170101
1    20170102
2    20170102
3    20170104
4    20170104
5         NaN
dtype: object

In [11]:
import numpy as np

In [14]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4),index=['a','c','d'],columns = ['item1','item2','item3','item4'])

In [15]:
df1

   item1  item2  item3  item4
a      0      1      2      3
c      4      5      6      7
d      8      9     10     11

In [17]:
df1.reindex(['a','b','c','d'],fill_value=0)

   item1  item2  item3  item4
a      0      1      2      3
b      0      0      0      0
c      4      5      6      7
d      8      9     10     11

In [18]:
df1

   item1  item2  item3  item4
a      0      1      2      3
c      4      5      6      7
d      8      9     10     11

In [19]:
df2 = df1.reindex(['a','b','c','d'],fill_value=0)

In [20]:
status = ['col1','item2','item3']

In [21]:
print(df1.reindex(columns=status))

   col1  item2  item3
a   NaN      1      2
c   NaN      5      6
d   NaN      9     10

In [22]:
df1.reindex(index=['a','b','c','d'],method='ffill',columns=status)

   col1  item2  item3
a   NaN      1      2
b   NaN      1      2
c   NaN      5      6
d   NaN      9     10